import ArrowRight from "@/components/icons/ArrowRight"
import WalletFaq from "@/components/payment/WalletFaq";
import Link from "next/link"

const Faq = () => {

    const faqItems: {
        content: React.ReactNode;
        title: React.ReactNode;
        key: string;
    }[] = [
        {
            key:"1",
            title:"کیف پول ایران گیم سنتر چیست؟",
            content:"کیف پول ایران گیم سنتر یک روش ساده، سریع و مطمئن برای پرداخت خریدهای شما در سایت است. با استفاده از کیف پول، می‌توانید بدون نیاز به ورود مکرر اطلاعات کارت بانکی، پرداخت‌های خود را انجام دهید. این قابلیت به شما امکان می‌دهد تا موجودی خود را مدیریت کنید، پرداخت‌های سریع‌تری داشته باشید و از تخفیف‌های ویژه‌ای که مخصوص پرداخت با کیف پول هستند، بهره‌مند شوید.",
        },
        {
            key:"2",
            title:"چگونه می‌توانم کیف پول خود را شارژ کنم؟",
            content:'برای شارژ کیف پول، ابتدا وارد حساب کاربری خود شوید و به بخش "کیف پول" بروید. سپس مبلغ موردنظر خود را وارد کنید و یکی از روش‌های پرداخت اینترنتی را انتخاب نمایید. پس از تکمیل مراحل پرداخت، موجودی شما بلافاصله در حساب کاربری‌تان نمایش داده می‌شود. توجه داشته باشید که فقط پرداخت‌هایی که از طریق درگاه بانکی انجام شوند، قابل برداشت خواهند بود. شارژهای دریافت‌شده از جوایز یا تخفیف‌ها فقط برای خرید از سایت قابل استفاده هستند.'
        },
        {
            key:"3",
            title:"با کیف پول چه چیزهایی می‌توانم خریداری کنم؟",
            content:"با موجودی کیف پول خود می‌توانید انواع خدمات و محصولات دیجیتالی را خریداری کنید. این موارد شامل خرید اکانت‌های بازی‌های کنسولی مانند PlayStation و Xbox، پرداخت‌های درون‌برنامه‌ای برای بازی‌های موبایلی (مانند خرید جم، سکه و آیتم‌های ویژه)، انواع گیفت کارت‌های معتبر جهانی (مانند PlayStation Store، Xbox Live، Steam، Google Play و Apple Store) و سایر محصولات دیجیتال است. با این روش، پرداخت‌های شما سریع‌تر انجام می‌شود و از خطاهای احتمالی در وارد کردن اطلاعات بانکی جلوگیری خواهد شد."
        },
        {
            key:"4",
            title:"چگونه می‌توانم از موجودی کیف پول برای پرداخت استفاده کنم؟",
            content:'هنگام خرید محصول یا پرداخت هزینه خدمات در سایت ایران گیم سنتر، در مرحله انتخاب روش پرداخت، گزینه "پرداخت با کیف پول" را فعال کنید. اگر موجودی کیف پول شما کافی باشد، خرید شما بلافاصله تکمیل خواهد شد. در صورتی که موجودی شما کمتر از مبلغ خرید باشد، می‌توانید مابقی را از طریق پرداخت اینترنتی تکمیل کنید. این قابلیت به شما امکان می‌دهد که بخشی از خرید را با کیف پول و بخش دیگر را با کارت بانکی انجام دهید.'
        },
        {
            key:"5",
            title:"آیا امکان برداشت وجه از کیف پول وجود دارد؟",
            content:"بله، اما تنها برای مبالغی که از طریق پرداخت اینترنتی به کیف پول شما اضافه شده‌اند. به عبارت دیگر، اگر کیف پول خود را با استفاده از کارت بانکی شارژ کرده باشید، امکان برداشت و انتقال وجه آن به حساب بانکی شما وجود دارد. اما مبالغی که به عنوان هدیه، تخفیف یا پاداش به کیف پول اضافه شده‌اند، قابل برداشت نیستند و تنها برای خرید از سایت قابل استفاده خواهند بود. این سیاست برای جلوگیری از سوءاستفاده‌های احتمالی و ارائه تخفیف‌های ویژه به کاربران واقعی در نظر گرفته شده است."
        },
        {
            key:"6",
            title:"چگونه می‌توانم مبلغ کیف پول را برداشت کنم؟",
            content:'برای برداشت وجه از کیف پول، ابتدا وارد حساب کاربری خود شوید و به بخش "کیف پول" بروید. سپس گزینه "برداشت وجه" را انتخاب کنید و مبلغ موردنظر خود را وارد نمایید. همچنین باید شماره کارت بانکی خود را وارد کنید تا وجه به حساب شما واریز شود. درخواست برداشت پس از بررسی تأیید خواهد شد و معمولاً طی ۱ تا ۳ روز کاری مبلغ موردنظر به حساب شما واریز می‌شود. لطفاً توجه داشته باشید که در برخی موارد، بسته به قوانین بانکی و زمان پردازش سیستم‌های مالی، ممکن است این فرآیند کمی بیشتر زمان ببرد.'
        },
        {
            key:"7",
            title:"آیا می‌توانم موجودی کیف پول خود را به شخص دیگری انتقال دهم؟",
            content:"خیر، موجودی کیف پول ایران گیم سنتر فقط برای استفاده در حساب کاربری شما در این سایت قابل استفاده است و امکان انتقال آن به حساب کاربری دیگر وجود ندارد. این سیاست به دلیل مسائل امنیتی و جلوگیری از سوءاستفاده‌های احتمالی اعمال شده است. در صورتی که قصد دارید برای شخص دیگری خرید کنید، می‌توانید با کیف پول خود محصول موردنظر را خریداری کرده و اطلاعات موردنیاز را برای او ارسال کنید."
        },
        {
            key:"8",
            title:" اگر هنگام خرید فراموش کنم از کیف پول استفاده کنم، آیا می‌توانم بعداً مبلغ را از کیف پول کم کنم؟",
            content:'خیر، پس از انجام پرداخت، امکان تغییر روش پرداخت و استفاده از کیف پول وجود ندارد. به همین دلیل، قبل از نهایی کردن خرید، حتماً گزینه "پرداخت با کیف پول" را بررسی کنید. در صورتی که از کیف پول خود استفاده نکرده‌اید و پرداخت را با کارت بانکی انجام داده‌اید، متأسفانه امکان بازگشت وجه به کیف پول یا تغییر روش پرداخت وجود نخواهد داشت.'
        },
        {
            key:"9",
            title:" چگونه می‌توانم موجودی کیف پول خود را بررسی کنم؟",
            content:'برای مشاهده موجودی کیف پول خود، وارد حساب کاربری‌تان شوید و به بخش "کیف پول" بروید. در این بخش، موجودی فعلی شما نمایش داده می‌شود و همچنین می‌توانید تاریخچه تراکنش‌های کیف پول خود را مشاهده کنید. این بخش شامل جزئیات مربوط به هر تراکنش مانند مبلغ واریز یا برداشت، تاریخ و نوع تراکنش (شارژ، خرید، برداشت و غیره) است که به شما کمک می‌کند تا مدیریت بهتری روی موجودی خود داشته باشید.'
        },
        {
            key:"10",
            title:"آیا موجودی کیف پول من تاریخ انقضا دارد؟",
            content:"خیر، موجودی کیف پول شما تاریخ انقضا ندارد و تا زمانی که از آن استفاده نکنید، در حساب شما باقی خواهد ماند. شما می‌توانید در هر زمان دلخواه از موجودی کیف پول خود برای خرید محصولات و خدمات سایت ایران گیم سنتر استفاده کنید."
        },
        {
            key:"11",
            title:"اگر حساب کاربری من مسدود شود، آیا به موجودی کیف پول خود دسترسی دارم؟",
            content:'در صورتی که حساب کاربری شما به دلیل تخلف از قوانین سایت مسدود شود، دسترسی به کیف پول نیز غیرفعال خواهد شد. اگر مسدود شدن حساب موقتی باشد، پس از رفع محدودیت، موجودی کیف پول شما همچنان قابل استفاده خواهد بود. اما در صورتی که حساب شما به‌طور دائم مسدود شود، تیم پشتیبانی بررسی خواهد کرد که آیا مبلغی قابل بازگشت به شما هست یا خیر. تصمیم‌گیری در این خصوص مطابق با شرایط و قوانین سایت انجام می‌شود.'
        }
    ];

    return (
        <>
            <header className="flex items-center gap-5 p-4 text-xs">
                <Link href="/profile/wallet" className="w-6 h-6">
                    <ArrowRight />
                </Link>
                سوالات متداول
            </header>
            <div className="px-3.5">
                <WalletFaq 
                    items={faqItems}
                />
            </div>
        </>
    )
}

export default Faq;